usr.sbin/ipfwlog/ipfwlog.8
.\" Copyright (c) 2001 Wind River Systems, Inc.  All rights reserved.
.\"
.\" Copyright (c) 1996,1997 Berkeley Software Design, Inc.
.\" All rights reserved.
.\" The Berkeley Software Design Inc. software License Agreement specifies
.\" the terms and conditions for redistribution.
.\"
.\"	BSDI ipfwlog.8,v 1.10 2001/10/03 17:29:59 polk Exp
.\"
.Dd November 12, 1996
.Dt IPFWLOG 8
.Os BSD 4
.Sh NAME
.Nm ipfwlog
.Nd display BSD IP Filter logging
.Sh SYNOPSIS
.Nm ipfwlog
.Op Fl cdknRx
.Op Fl b Ar bits
.Op Fl l Ar logfile
.Op Fl L Ar facility.priority
.Op Fl m Ar mask
.Op Fl r Ar rcvsize
.Op Fl fIiOo
.Op Ar file
.Sh DESCRIPTION
The
.Nm ipfwlog
utility displays packets returned from a BSD IP Filter, or from
.Ar file .
If
.Ar file
is specified then it should contain packets previously stored by
.Nm ipfwlog
using the
.Fl R
and
.Fl l
options.
.Pp
The options available are:
.Bl -tag -width indent
.It Fl b
Require the specified user
.Ar bits
be set.  The user bits are specified by a mask in the range of 0x00 - 0xff
.It Fl c
Unless
.Fl c
is specified, IPFW informational messages (such as circuits closing)
are not displayed.
.It Fl d
Run as a daemon, requires the
.Fl l
option as well.
The PID of the running process will be store in
.Pa /var/run/ipfwlog.pid
.It Fl k
Send a
.Nm SIGHUP
to the currently running
.Nm ipfwlog
daemon (started with
.Fl d )
before doing any logging.  This is typically used when reading from a
raw packet log being generated by an
.Nm ipfwlog
daemon to force it to close and reopen the logfile.  This can also be used
when rotating log files.
If
.Ar file
is not specified then
.Nm ipfwlog
will exit after sending the
.Nm SIGHUP .
.It Fl L
Rather than logging to a file, log to syslog.  The values that
.Ar facility
and
.Ar priority
can take are listed in
.Xr syslog 3 .
Either or both of these may be absent.  Using just ``.''
will use the default priority of
.Nm notice
and the default facility of
.Nm user .
.It Fl l
Rather than logging to standard output, log to the file named
.Ar logfile .
.It Fl m
Specify the
.Ar mask
to use when checking the user bits.  The mask in the range of 0x00 - 0xff.
.It Fl n
Do not do reverse name lookup on IP addresses or port number lookups.
.It Fl R
Run in raw mode, store the raw packets received for future interrogation.
.It Fl r
Change the receive buffer on the logging socket to
.Ar rcvsize
bytes.
.It Fl x
When not using raw mode, also display the context of the packet in HEX.
.It Fl f
Display packets from the forwarding BSD IP Filter.
.It Fl I
Display packets from the pre-input BSD IP Filter.
.It Fl i
Display packets from the input BSD IP Filter.
.It Fl O
Display packets from the pre-output BSD IP Filter.
.It Fl o
Display packets from the output BSD IP Filter.
.El
.Sh OUTPUT
The output format produced by
.Nm ipfwlog
depends on the type of packet being logged.
All packets start with the following fields:
.Bl -tag -width indent
.It date
The year/month/day the packet was logged.
.It time
The hour:minute:second the packet was logged.
.It disposition
This is a single character field which is one of:
.Bl -tag -width indent
.It <space>
An empty space implies this packet was accepted by the filter and is
only be reported.
.It !
The packet was rejected by the filter.
.It c
This is a control message from the filter.  For example, a circuit
cache has concluded a TCP circuit entry.
.El
.It filter
This is a single character field which is appended to the above field.
It may be one of:
.Bl -tag -width indent
.It f
The forward filter reported this packet.
.It I
The pre-input filter reported this packet.
.It i
The input filter reported this packet.
.It O
The pre-output filter reported this packet.
.It o
The output filter reported this packet.
.El
.It user-code
The two byte user code, displayed in hex.
See
.Xr ipfwcmp 8
for more information on user codes.
.It srcaddr
The source IP address associated with the packet.
.It dstaddr
The destination IP address associated with the packet.
.El
.Pp
The remaining fields are dependent on the version of IP and the protocol.
IPv4 packets will have the flag and fragment information display.  The
following 3 flags may be displayed:
.Bl -tag -width indent
.It R
The reserved bit was set, this should not happen.
.It D
The don't fragment bit was set.
.It M
The more fragments bit was set.
.El
.Pp
If this packet is not the initial fragment of the packet (the offset
field is not zero) then
.Li frag @ Ar offset
will be printed.
.Pp
Both UDP and TCP packets will have their source and destination ports
displayed.
In addition, TCP will display the TCP flags:
.Bl -tag -width indent
.It F
The FIN bit was set.
.It S
The SYN bit was set.
.It R
The RESET bit was set.
.It P
The PUSH bit was set.
.It A
The ACK bit was set.
.It U
The URGENT bit was set.
.It 4
The reserved bit 0x40 was set.
.It 8
The reserved bit 0x80 was set.
.El
.Pp
ICMP packets will display the type and code of the packet.
.Pp
Packets of other protocols display
.Li P Ns Ar protocol
where
.Ar protocol
is the protocol number listed in the IP packet.
.Pp
Packets other than IPv4, IPv6, or IPFW control packets are displayed only
as
.Li IPv Ns Ar version
where
.Ar version
is the IP version of the packet.
.Sh BUGS
This program is just slightly better than the "Pooh" variety,
having just slightly more than very little brain.
.Sh SEE ALSO
.Xr ipfw 8
