sbin/splice/splice.8
.\"	BSDI splice.8,v 1.3 1996/08/22 00:20:54 cp Exp
.\"
.Dd February 27, 1996
.Dt SPLICE 8
.Os BSD 4
.Sh NAME
.Nm splice
.Nd "configure splice (disk array) devices"
.Sh SYNOPSIS
.Nm splice
.Op Fl v 
.Op Fl i Ar interleave
.Op Fl u Ar unit
.Ar partition
.Ar partition
.Op Ar partition ...
.Sh DESCRIPTION
The
.Nm splice
program joins multiple physical disk partitions into an
.Xr sp 4
unit, which then behaves as if it were a single disk.
The partitions to be joined need not
be the same size.
Typically
.Nm splice
is run out of
.Xr rc 8
before running
.Xr fsck 8 .
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl i
Specifies the interleave for the new logical disk.
If this is zero, the given partitions are concatenated.
Otherwise, the interleave defines how many (512 byte) blocks are taken
from each underlying partition before switching to the next.
The default value is 2048 blocks (1 megabyte), which is
reasonable for most applications.
.It Fl u
Specifies the unit
.Pq Dq disk
number for the
.Xr sp 4
unit to be built.
The default unit is 0.
.It Fl v
Causes
.Nm splice
to show the mapping from partitions into the newly-constructed
.Xr sp 4
device.
.Sh FILES
.Bl -tag -width /dev/splice -compact
.It Pa /dev/splice
.Xr sp 4
configuration device
.El
.Sh EXAMPLES
.Bl -tag -width Ds
.It splice /dev/sd1c /dev/sd2c
Build
.Xr sp 4
unit 0 (/dev/sp0[a-h] and /dev/rsp0[a-h])
from partitions /dev/sd1c and /dev/sd2c.
.It splice -u 1 /dev/sd1h /dev/sd2c
Build
.Xr sp 4
unit 1 (/dev/sp1[a-h] and /dev/rsp1[a-h])
from partitions /dev/sd1h and /dev/sd2c.
.El
.Sh SEE ALSO
.Xr rc 8 ,
.Xr sp 4
