usr.sbin/pstat/pstat.8
.\"	BSDI pstat.8,v 2.6 1997/11/07 14:06:57 prb Exp
.\"
.\" Copyright (c) 1980, 1991, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)pstat.8	8.5 (Berkeley) 5/13/94
.\"
.Dd May 13, 1994
.Dt PSTAT 8
.Os BSD 4
.Sh NAME
.Nm pstat
.Nd display system data structures
.Sh SYNOPSIS
.Nm pstat
.Op Fl fnsTtv
.Op Fl M Ar core
.Op Fl N Ar system
.Sh DESCRIPTION
.Nm Pstat
displays the open file entries, swap space utilization, vnode entries,
terminal state, and vnode data structures.
.Pp
The following options are available:
.Bl -tag -width indent
.It Fl f
Print the open file entries with the following headings:
.Pp
.Bl -tag -compact -width indent
.It LOC
The core location of this entry.
.It TYPE
The type of object the file entry points to.
.It FLG
Miscellaneous state variables with the following encoding:
.Pp
.Bd -literal -compact
A	open for appending
I	signal pgrp when data ready
R	open for reading
S	shared lock present
W	open for writing
X	exclusive lock present
.Ed
.Pp
.It CNT
Number of processes that know this open file.
.It MSG
Number of messages outstanding for this file.
.It DATA
The location of the vnode entry or socket structure for this file.
.It OFFSET
The file offset (see
.Xr lseek 2 ) .
.El
.Pp
See
.Xr fstat 1
for additional information on open files.
.It Fl M
Extract values associated with the name list from the specified
.Ar core
instead of the default
.Pa /dev/kmem .
.It Fl N
Extract the name list from the specified system instead of the default
.Pa /bsd .
.It Fl n
The
.Fl n
option specifies that devices should be printed out by major/minor
number rather than by name.
.It Fl s
Print the swap (paging) space usage information on all of the swap areas
compiled into the system, with the following headings:
.Pp
.Bl -tag -compact -width indent
.It "Device name"
The device name of the partition.
.It "XX-blocks"
The total space available in the partition in blocks
(determined by the
.Ev BLOCKSIZE
environment variable, 512 bytes by default).
This will be slightly smaller
than the corresponding partition size,
since the first few sectors of each area are skipped
(to avoid writing on a disk label and for other internal reasons).
.It "Type"
If the swap partition is currently in use, the type is listed
either as
.Ar Interleaved
or
.Ar Sequential .
The list begins with swap partitions that were pre-configured into the system.
The first of these is enabled automatically when the system starts up;
others must be enabled using
.Xr swapon 8 .
If the partition has not been enabled,
the partition is marked as not currently available for use.
Allocations are interleaved across the pre-configured devices that
have been enabled, and those partitions are marked as
.Ar Interleaved .
Swap partitions that were not pre-configured can be added with
.Xr swapon 8 ;
space is allocated from these partitions sequentially when space
is not available on preceding partitions.
These partitions are marked
.Ar Sequential .
.El
.Pp
The number of blocks in use, the total number of blocks for the partitions
enabled, and the percentage of space in use are also printed.
.It Fl T
Prints the number of open file and vnode entries used, the current limit
on the number of open file entries, and the amount of swap space in use
and total.
It is useful for checking to see how large system tables have become
when the system is under heavy load.
.It Fl t
Print information about each terminal with the following headings:
.Pp
.Bl -tag -compact -width indent
.It RAW
Number of characters in raw input queue.
.It CAN
Number of characters in canonicalized input queue.
.It OUT
Number of characters in the output queue.
.It HWT
Maximum number of characters in the queue before the producer will sleep.
.It LWT
Number of characters in the queue at which point the produce will be
awoken.
.It COL
Calculated column position of terminal.
.It STATE
Miscellaneous state variables with the following encoding:
.Pp
.Bd -literal -compact
A	process is awaiting output
B	busy doing output
C	carrier is on
D	state for lowercase \ work
E	within a \\.../ for ECHOPRT
F	outq has been flushed during DMA
K	further input blocked
L	next character is literal
N	counting tab width, ignore FLUSHO
O	open
P	retyping suspended input
S	output stopped
T	delay timeout in progress (not currently used)
W	waiting for open to complete
X	open for exclusive use
Y	tty in async I/O mode
Z	process waiting for tty to empty
.Ed
.Pp
.It SESS
Address of enclosing session.
.It PGID
Process group for which this is controlling terminal.
.It DISC
Line discipline; 
.Ar term
indicates the standard terminal discipline
.Ar TTYDISC
(see
.Xr termios 4 ) .
Other possibilities include
.Ar slip
(\c
.Xr sl 4 )
and
.Ar ppp
(\c
.Xr ppp 4 ) .
.El
.It Fl v
Print the active vnode entries.
Each group of vnodes corresponding to a particular filesystem is preceded
by a two line header.
The first line consists of the following:
.Pp
.Df I
.No *** MOUNT Em fstype from 
on
.Em on fsflags
.De
.Pp
where
.Em fstype
is one of
.Em ufs , nfs , mfs , or pc ;
.Em from
is the filesystem is mounted from;
.Em on
is the directory
the filesystem is mounted on; and
.Em fsflags
is a list
of optional flags applied to the mount (see
.Xr mount 8 ) .
.The second line is a header for the individual fields ,
the first part of which are fixed, and the second part are filesystem
type specific.  The headers common to all vnodes are:
.Pp
.Bl -tag -compact -width indent
.It ADDR
Location of this vnode.
.It TYP
File type.
.It VFLAG
A list of letters representing vnode flags:
.Pp
.Bd -literal -compact
A	VALIASED
B	VBWAIT
I	VISTTY
L	VXLOCK
R	VROOT
S	VSYSTEM
T	VTEXT
W	VXWANT
.Ed
.Pp
.It USE
The number of references to this vnode.
.It HOLD
The number of I/O buffers held by this vnode.
.It FILEID
The vnode fileid.
In the case of
.Em ufs
this is the inode number.
.It IFLAG
Miscellaneous filesystem specific state variables encoded thus:
.Bl -tag -width indent
.It "For ufs:"
.Pp
.Bd -literal -compact
A	access time must be corrected
C	changed time must be corrected
E	exclusive lock applied
L	locked
M	contains modifications
R	has a rename in progress
S	shared lock applied
U	update time must be corrected
W	wanted by another process (L flag is on)
Z	someone waiting for a lock
.Ed
.It "For nfs:"
.Pp
.Bd -literal -compact
E	an earlier write failed
G	lease was evicted (nqnfs)
M	locally modified data exists
O	write lease (nqnfs)
P	I/O buffers being flushed
W	waiting for I/O buffer flush to complete
X	non-cacheable lease (nqnfs)
.Ed
.El
.It SIZ/RDEV
Number of bytes in an ordinary file, or
major and minor device of special file.
.El
.Sh FILES
.Bl -tag -width /dev/kmemxxx -compact
.It Pa /bsd
default system namelist
.It Pa /dev/kmem
default information source
.El
.Sh ENVIRONMENT VARIABLES
.Bl -tag -width BLOCKSIZE
.It Ev BLOCKSIZE
If the environmental variable
.Ev BLOCKSIZE
is set, swap block counts will be displayed in units of that size block.
.El
.Sh SEE ALSO
.Xr fstat 1 ,
.Xr ps 1 ,
.Xr systat 1 ,
.Xr stat 2 ,
.Xr fs 5 ,
.Xr iostat 8 ,
.Xr swapon 8 ,
.Xr vmstat 8
.Rs
.Rt Tn UNIX Rt Implementation ,
.Ra K. Thompson
.Re
.Sh BUGS
Does not understand NFS swap servers.
.Sh HISTORY
The
.Nm pstat
command appeared in 4.0BSD.
