share/man/man5/types.5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)types.5	8.2 (Berkeley) 4/28/95
.\"
.Dd April 28, 1995
.Dt TYPES 5
.Os BSD 4
.Sh NAME
.Nm types
.Nd system data types
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Sh DESCRIPTION
The file
.Aq sys/types.h
contains defined data types used throughout the system.
.Bd -literal
/* Architecture dependent types. */
typedef unsigned long		 clock_t;
typedef unsigned int		  size_t;
typedef int			 ssize_t;
typedef long			  time_t;

/* Virtual memory objects. */
typedef	unsigned long	     vm_offset_t;
typedef	unsigned long	       vm_size_t;

/* The longest/most efficient integer register type. */
typedef	int32_t			register_t;

/* Architecture independent types. */

/* Basic integral types of exactly the implied number of bits. */
typedef	__signed char		   int8_t;
typedef	unsigned char		 u_int8_t;
typedef	short			  int16_t;
typedef	unsigned short		u_int16_t;
typedef	int			  int32_t;
typedef	unsigned int		u_int32_t;
typedef	long long		  int64_t;
typedef	unsigned long long	u_int64_t;

/* Basic integral types of at least the implied number of bits. */
typedef	__signed char		   int8m_t;
typedef	unsigned char		 u_int8m_t;
typedef	short			  int16m_t;
typedef	unsigned short		u_int16m_t;
typedef	int			  int32m_t;
typedef	unsigned int		u_int32m_t;
typedef	long long		  int64m_t;
typedef	unsigned long long	u_int64m_t;

typedef	unsigned long		    u_long;
typedef	unsigned int		     u_int;
typedef	unsigned short		   u_short;
typedef	unsigned char		    u_char;
typedef	unsigned int		      uint;	/* Sys V compatibility */
typedef	unsigned short		    ushort;	/* Sys V compatibility */

typedef	u_int64_t		  u_quad_t;	/* quads */
typedef	int64_t			    quad_t;
typedef	quad_t *		   qaddr_t;

typedef	char *			   caddr_t;	/* core address */
typedef	long			   daddr_t;	/* disk address */
typedef	unsigned long		     dev_t;	/* device number */
typedef unsigned long		   fixpt_t;	/* fixed point number */
typedef	unsigned int		     gid_t;	/* group id */
typedef	unsigned long		     ino_t;	/* inode number */
typedef	long			     key_t;	/* Sys V IPC key */
typedef	u_int16m_t		    mode_t;	/* permissions */
typedef	u_int16m_t		   nlink_t;	/* link count */
typedef	quad_t			     off_t;	/* file offset */
typedef	int			     pid_t;	/* process id */
typedef	long			   segsz_t;	/* segment size */
typedef	long			   swblk_t;	/* swap offset */
typedef	unsigned int		     uid_t;	/* user id */
.Ed
.Sh HISTORY
A
.Aq sys/types.h 
file appeared in
.At v7 .
