usr.sbin/ac/ac.8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)ac.8	8.2 (Berkeley) 4/19/94
.\"
.Dd April 19, 1994
.Dt AC 8
.Os BSD 4
.Sh NAME
.Nm ac
.Nd display connect time accounting
.Sh SYNOPSIS
.Nm ac
.Op Fl dp
.Op Fl w Ar file
.Op Ar users ...
.Sh DESCRIPTION
If the file
.Pa /var/log/wtmp
exists,
a record of system event and individual login and logout times are written
to it by
.Xr init 8
and
.Xr login 8 .
The program
.Nm ac
examines these
records and writes the accumulated connect time for individual logins to
the standard output.
.Pp
The following options are available:
.Bl -tag -width people
.It Fl d
Display the connect times in 24 hour periods.
.It Fl p
Display individual user totals.
.It Fl w Ar file
Read raw connect time data from
.Ar file
instead of the default file
.Pa /var/log/wtmp .
.El
.Pp
If
.Ar user
arguments are specified,
information is given for only those users.
Otherwise,
.Nm ac
displays information for all users for which there is data.
.Pp
The
.Pa wtmp
file will grow forever,
and therefore must be periodically truncated.
This is normally done by the daemon script
.Pa /etc/monthly ,
(scheduled by
.Xr cron 8 ),
which renames and rotates the
.Pa wtmp
files before truncating them (retaining about six month's worth).
No information is collected however,
if the
.Pa wtmp
file does not exist.
.Pp
All users are presumed to have logged out if the system shuts down
or reboots.
.Pp
Any logout records without preceding login records are ignored,
thus user sessions starting before the raw data begins will not
be included in the report.
For this reason, 
.Nm ac
may not correctly present data for users that were logged in when
the
.Pa wtmp
files were rotated.
To obtain correct data, either 
request data on a per-day basis (the
.Fl d
option) or concatenate multiple log files together in their creation
order and run
.Nm ac
on the result.
.Pp
Any login records without subsequent logout records when the raw data ends
will be treated as if the user logged out at midnight of the last day for
which there is any login record,
or as of the current time-of-day,
whichever is earlier.
.Sh FILES
.Bl -tag -width /var/log/wtmp.[0-7] -compact
.It Pa /var/log/wtmp
.It Pa /var/log/wtmp.[0-7]
rotated files
.El
.Sh SEE ALSO
.Xr utmp 5 ,
.Xr init 8 ,
.Xr login 8 ,
.Xr sa 8
.Sh HISTORY
An
.Nm ac
command appeared in Version 6 AT&T UNIX.
