usr.sbin/i386/stlload/stlload.8
.\" Copyright (c) 1996 Stallion Technologies Pty Ltd.
.\" All rights reserved.
.Dd Jul 8, 1996
.Os BSD 4
.Dt STLLOAD 8 i386
.Os
.Sh NAME
.Nm stlload
.Nd "Stallion Technologies multiport serial board down loader"
.Sh SYNOPSIS
.Nm stlload
.Op Fl vhVR
.Op Fl i Ar image-file
.Op Fl c Ar control-device
.Op Fl r Ar rx-buf-size
.Op Fl t Ar tx-buf-size
.Op Fl B Ar boot-banner
.Op Fl b Ar unit-number
.Sh DESCRIPTION
.Nm stlload
is used to download the firmware code to Stallion Technologies intelligent
multiport serial boards.
A firmware download is only required for those boards that use the Stallion
.Nm stli
driver.
This includes the EasyConnection 8/64, ONboard and Brumby families of boards.
.Pp
Different board types require different firmware images.
If the wrong firmware is loaded into a board it will fail to operate.
.Pp
The download process is achieved through the Stallion
.Nm stli
driver control device,
.Pa /dev/stliomemX .
This device implements a file type device that can read and write into the
boards shared memory region.
It also implements a number of special
.Pa ioctls
that reset and restart the board.
.Pp
The options are:
.Bl -tag -width xxxxx
.It Fl v
Verbose output generation.
Trace is generated at each phase of the download and startup process.
.It Fl h
Output usage information.
.It Fl V
Output version information.
.It Fl R
Reset the board only.
Does not proceed to download firmware to the board.
.It Fl i Ar image-file
Specify the firmware image file to download.
The default firmware image is /usr/libdata/stallion/cdk.sys.
.It Fl c Ar control-device
Specify the board control device through which to download the firmware
and start up the board.
The default is /dev/stliomem0.
.It Fl r Ar rx-buf-size
Specify the size of the boards shared memory Receive Data buffer.
By default the buffer is dynamically sized to use the maximum
available shared memory.
.It Fl t Ar tx-buf-size
Specify the size of the boards shared memory Transmit Data buffer.
By default the buffer is dynamically sized to use the maximum
available shared memory.
.It Fl B Ar boot-banner
Enable the slave debug trace flag during download.
This enables debug trace output from the firmware code.
This trace is output on port 0 of the board,
and the port is set to 9600 baud, 8 data bits, no parity and 1 stop bit.
.It Fl b Ar unit-number
Specify the unit (board) number to be downloaded.  The default is to
download board 0.
.El
.Pp
.Nm stlload
is typically run from
.Pa /etc/rc.hardware .
A sample script is provided as
.Pa /etc/rc.hardware/stli.proto ,
showing typical usage.
Normally this is all that will be required.
.Sh FILES
.Bl -tag -width /usr/libdata/stallion/2681.sys
.It Pa /usr/libdata/stallion/cdk.sys
firmware code to EasyConnection 8/64 class boards
.It Pa /usr/libdata/stallion/2681.sys
firmware code to ONboard and Brumby class boards
.Sh SEE ALSO
.Xr stl 4 ,
.Xr stlstats 8 ,
.Xr rc 8
.Sh HISTORY
This program was originally developed by Greg Ungerer (gerg@stallion.com).
