usr.bin/login/login.8
.\"	BSDI login.8,v 2.8 1997/10/08 20:49:32 prb Exp
.\"
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"	@(#)login.1	8.2 (Berkeley) 5/5/94
.\"
.Dd May 5, 1994
.Dt LOGIN 8
.Os BSD 4
.Sh NAME
.Nm login
.Nd log into the computer
.Sh SYNOPSIS
.Nm login
.Op Fl Bfp
.Op Fl h Ar hostname
.Op Fl L Ar local-ip-address
.Op Fl R Ar remote-ip-address
.Op Ar user
.Sh DESCRIPTION
The
.Nm login
utility logs users (and pseudo-users) into the computer system.
It is normally only executable by the super user.
.Pp
If no user is specified, or if a user is specified and authentication
of the user fails,
.Nm login
prompts for a user name.
Authentication of users is normally done via passwords, though
external authentication mechanisms may be used (see
.Xr login.conf 5 Ns No ).
To specify the alternate authentication mechanism
.Va style ,
the string
.Li : Ns Va style
is appended to the user name (i.e.,
.Ar user Ns Li : Ns Va style Ns ).
.Pp
The options are as follows:
.Bl -tag -width Ds
.It Fl B
Do not print welcome banners.
.It Fl f
The
.Fl f
option is used when a user name is specified to indicate that proper
authentication has already been done and that no password need be
requested.
.It Fl h
The
.Fl h
option specifies the host from which the connection was received.
It is used by various daemons such as
.Xr telnetd  8 .
This option may only be used by the super-user.
.It Fl L
The
.Fl L
option specifies the local ip address of a socket such as telnetd
would use.
This information is passed on to any classify script (see
.Xr login.conf 5 ) .
.It Fl p
By default,
.Nm login
discards any previous environment.
The
.Fl p
option disables this behavior.
.It Fl R
The
.Fl R
option specifies the remote ip address of a socket such as telnetd
would use.
This information is passed on to any classify script (see
.Xr login.conf 5 ) .
.El
.Pp
If the file
.Pa /etc/nologin
exists,
.Nm login
displays its contents to the user and exits.
This is used by
.Xr shutdown  8
to prevent users from logging in when the system is about to go down.
.Pp
Immediately after logging a user in,
.Nm login
displays the system copyright notice, the date and time the user last
logged in, the message of the day as well as other information.
If the file
.Dq Pa .hushlogin
exists in the user's home directory, all of these messages are suppressed.
This is to simplify logins for non-human users, such as
.Xr uucp 1 .
.Nm Login
then records an entry in the
.Xr wtmp 5
and
.Xr utmp 5
files and executes the user's command interpretor.
.Pp
Login enters information into the environment (see
.Xr environ 7 )
specifying the user's home directory (HOME), command interpreter (SHELL),
search path (PATH), terminal type (TERM) and user name (both LOGNAME and
USER).
.Sh FILES
.Bl -tag -width /var/mail/userXXX -compact
.It Pa /etc/login.conf
login configuration
.It Pa /etc/motd
message-of-the-day
.It Pa /etc/nologin
disallows logins
.It Pa /var/run/utmp
current logins
.It Pa /var/log/lastlog
last login account records
.It Pa /var/log/wtmp
login account records
.It Pa /var/mail/user
system mailboxes
.It Pa \&.hushlogin
makes login quieter
.El
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr passwd 1 ,
.Xr rlogin 1 ,
.Xr getpass 3 ,
.Xr setusercontext 3 ,
.Xr login.conf 5 ,
.Xr utmp 5 ,
.Xr environ 7 ,
.Sh HISTORY
A
.Nm login
appeared in
.At v6 .
