usr.sbin/tokeninit/tokeninit.8
.\"	BSDI tokeninit.8,v 1.3 1997/01/16 03:23:11 bostic Exp
.\"
.\" Copyright (c) 1995, Migration Associates Corporation. All rights reserved.
.\" The Berkeley Software Design Inc. software License Agreement specifies
.\" the terms and conditions for redistribution.
.\"
.\"
.Dd September 26, 1995
.Dt TOKENINIT 8
.Os BSD/OS
.Sh NAME
.Nm activinit , cryptoinit , snkinit
.Nd Modify or add user in ActivCard, CRYPTOCard, or SNK-004 authentication system.
.Sh SYNOPSIS
.Nm tokeninit
.Op Fl f
.Op Fl h
.Op Fl m Ar mode
.Op Fl s
.Op Fl v
.Ar user_ID
.Op Ar user_ID ...
.Sh DESCRIPTION
.Pp
The
.Nm tokeninit
utility may also be invoked by one of the names:
.Nm activinit , cryptoinit ,
or
.Nm snkinit .
Depending on the name it was invoked under, it will
initialize the system information to allow one to use the
ActivCard, CRYPTOCard or SNK-004 digital encryption token to login.
The
.Nm tokeninit
utility is intended for use by the system administrator.
.Pp
Token cards system provides strong user authentication by combining a user's
unique knowledge (a Personal Identification Number) and a physical object
(the token) which the user must have in their possession to login.
The system administrator programs the token with a secret encryption key 
which is also stored in the database.  The user programs the token with
a PIN.  To discourage exhaustive attempts to guess the PIN,
configuration options permit the token to be programmed
to erase knowledge of the shared secret should the user enter
an excessive number of incorrect PIN entries.
.Pp
The user activates the token by entering their PIN into the token.
After activating the token, the user enters a random number challenge
presented by the host computer into the token.  The challenge is encrypted by
the token and a response displayed.  The user then enters the 
response at the host computer's prompt, where it is compared with the
anticipated response.
.Pp
Token cards typically support multiple unique encryption keys.
This facility allows a single token to be used for multiple computer
systems, or multiple user instances on the same system.
.Sh OPTIONS
.Bl -hang
.It Fl f
Force reinitialization of an existing account.
The current shared secret stored in the database will be replaced a new
shared secret.
The new shared secret must be entered into the token,
replacing the current one.
.It Fl h
Read the shared secret as a 16 digit hexadecimal integer rather than
a sequence of 8 octets.
This is not supported when invoked as
.Nm snkinit .
.It Fl m
Specify the input modes allowed for this user.  Possible modes are
decimal (dec), hexadecimal (hex), phonebook (phone) and reduced-input (rim).
Not all modes are available for all types of cards.  Multiple
.Fl m
options may be specified to enable multiple modes.
By default only the hexadecimal mode is enabled, except for the SNK-004
token, which by default only enables the decimal mode.
If an attempt is made to initialize a card with only reduced-input, the
default mode for the card is silently included.
.It Fl s
By default,
.Nm tokeninit
prompts for a shared secret to enter into the authentication database.
The
.Fl s 
option generates a 64 bit cryptographically strong key for use in the token.
This shared secret will be saved
in the database for the user ID specified on the command line.
After entering the shared secret into the token,
determine that the checksum computed
by the token matches the one displayed by
.Nm tokeninit .
.It Fl v
Enable verbose mode.
.Nm tokeninit
will emit messages on the status of each user ID processed.
.El
.Sh REDUCED-INPUT MODE
Reduced-input mode allows the token to predict the next challenge,
given the current challenge.  This may be used to eliminate the need
to enter the challenge to the token or may also be used with a paper list.
Using a program such as
.Xr x99token 1
many challenges could be precomputed and printed.  This list should be
kept secret.  This list can then take the place of an actual token until
the system has issued all the challenges printed.
Challenges are predicted by the following algorithm:
.nf
.sp
* Encrypt the last challenge with the shared secret key

* AND each byte of the response with 0x0f

* Modulo each byte by 10 (0x0a)

* ADD 0x30 (ASCII value of '0') to each byte
.fi
.sp
The resulting 8 bytes are all ASCII decimal digits and are the next challenge.
.Sh DIAGNOSTICS
Diagnostic messages are logged via syslog(3) with the LOG_AUTH facility.
.Sh FILES
.Bl -tag -width xetcxcrypto.db
.It Pa /etc/activ.db
data base of information for ActivCard system
.It Pa /etc/crypto.db
data base of information for CRYPTOCard system
.It Pa /etc/snk.db
data base of information for SNK-004 system
.El
.Sh COMMENTS
A supplier for
ActivCard tokens may be obtained by contacting:
.Pp
.Bl -inset -offset indent
.It ActivCard, Inc.
.br
303 Twin Dolphin Dr., Ste 420
.br
Redwood City, CA 94065
.br
Tel: (415) 654-1700
.br
Fax: (415) 654-1701
.El
.Pp
CRYPTOCard tokens may be obtained by contacting:
.Pp
.Bl -inset -offset indent
.It CRYPTOCard Incorporated
.br
Attn: Wade Clark
.br
1649 Barclay Blvd.
.br
Buffalo Grove, Illinois 60089
.br
Tel: (800) 307-7042 / (708) 459-6500
.br
Fax: (708) 459-6599
.br
<token@cryptocard.com>
.El
.Pp
SNK-004 tokens may be obtained by contacting:
.Bl -inset -offset indent
.It Digital Pathways, Inc.
.br
Attn: Paul Kamian
.br
201 Ravendale Drive
.br
Mountain View, CA  94043-5216
.br
Tel: (415) 964-0707
.br
Fax: (415) 961-7487
.br
<paul@digpath.com>
.El
.Sh BUGS
Not all modes of all cards are supported.
.Pp
.Sh SEE ALSO
.Xr x99token 1 ,
.Xr syslog 3 ,
.Xr tokenadm 8 ,
.Xr tokenls 8 ,
.Xr login_token 8
.Sh AUTHOR
Jack Flory <jpf@mig.com>
